Revit 2026 API

# ElementFilter Methods

---

The ElementFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | PassesFilter(Element) | Applies the filter to a given element. |
|  | PassesFilter(Document, ElementId) | Applies the filter to a given element. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ElementFilter Class

Autodesk.Revit.DB Namespace